Revit 2027 API
ReleaseType Enumeration
 The release type.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum ReleaseType
Public Enumeration ReleaseType
public enum class ReleaseType
type ReleaseType
Members
Member name | Value | Description
BendingMoment | 2 |  Bending Moment.
Fixed | 0 |  Fixed.
Pinned | 1 |  Pinned.
UserDefined | 3 |  User Defined.
See Also
Reference
Autodesk.Revit.DB.Structure Namespace